app/models/user.rb

  def self.find_first_by_auth_conditions(warden_conditions)
    cond = warden_conditions.dup
    if login = cond.delete(:login)
      where(cond.to_hash).where("lower(username) = :value OR lower(email) = :value", value: login.downcase).first
---
SELECT "users".* FROM "users" WHERE (lower(username) = 'yiazmat' OR lower(email) = 'yiazmat') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]